In [1]:
import numpy as np 
import pandas as pd

In [2]:
import os
for dirname, _, filenames in os.walk('/kaggle/input'):
    for filename in filenames:
        print(os.path.join(dirname, filename))

In [3]:
df = pd.read_csv("C:/Users/q/Downloads/tested.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [4]:
df.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'], axis=1 , inplace = True)

In [5]:
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  34.5   7.8292
1         1       3  female  47.0   7.0000
2         0       2    male  62.0   9.6875
3         0       3    male  27.0   8.6625
4         1       3  female  22.0  12.2875

In [6]:
from sklearn.preprocessing import LabelEncoder 
le_Sex = LabelEncoder()
df['sex'] = le_Sex.fit_transform(df['Sex'])

In [7]:
df.drop(['Sex'],axis=1, inplace=True)

In [8]:
input = df.drop(['Survived'],axis=1)
target = df['Survived']
target.head()

0    0
1    1
2    0
3    0
4    1
Name: Survived, dtype: int64

In [9]:
input['Age'] = input['Age'].fillna(df['Age'].mean())

In [10]:
input['Fare'] = input['Fare'].fillna(df['Fare'].median())

In [11]:
df.head()

   Survived  Pclass   Age     Fare  sex
0         0       3  34.5   7.8292    1
1         1       3  47.0   7.0000    0
2         0       2  62.0   9.6875    1
3         0       3  27.0   8.6625    1
4         1       3  22.0  12.2875    0

In [12]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test =  train_test_split(input,target, test_size = 0.3)

In [13]:
y_train

195    0
14     1
325    0
25     0
58     0
      ..
334    0
47     0
321    0
86     1
363    0
Name: Survived, Length: 292, dtype: int64

In [14]:
X_train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 292 entries, 195 to 363
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Pclass  292 non-null    int64
 1   Age     292 non-null    float64
 2   Fare    292 non-null    float64
 3   sex     292 non-null    int32
dtypes: float64(2), int32(1), int64(1)
memory usage: 10.3 KB

In [15]:
X_train['Age'].value_counts

<bound method IndexOpsMixin.value_counts of 195    33.00000
14     47.00000
325    23.00000
25     50.00000
58     30.27259
         ...
334    27.00000
47     30.27259
321    25.00000
86     27.00000
363    27.00000
Name: Age, Length: 292, dtype: float64>

In [16]:
from sklearn import tree
model = tree.DecisionTreeClassifier()
model.fit(X_train,y_train)

DecisionTreeClassifier()

In [17]:
model.predict(X_test)

array([0, 1, 0, 1, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0,
       0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1,
       0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 0, 0, 1,
       0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0,
       1, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0,
       0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0], dtype=int64)

In [18]:
model.score(X_test,y_test)

1.0